sdaiValidateUniquenessBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,Sdai_Id_aggr*)
\details
Checks the constraint (Uniqueness-Rule) for the schema instance.
\param schemaInstance [in] A schema instance.
\param entityName     [in] A string that contains the name of the entity containing the uniqueness rule.
\param uniRuleName    [in] A string that contains the name of the constraint (Uniqueness-Rule) to be validated.
\param list           [out] An identifier of a pre-existing NPL that stores the list of entity instances that contains the instances with false validation result.
\returns sdaiTRUE if the uniqueness rule is satisfied; sdaiFALSE if the uniqueness rule is violated or sdaiUNKNOWN if an error has happened.